<template>
  <div>Привет! Ты можешь тут спарсить любой комикс с сайта
    <a href="https://thedoctorteam.ru/" target="_blank">thedoctorteam.ru</a>
    при помощи AI-агента, увидеть его здесь, добавить закладку, и все это сохранится в памяти твоего браузера.
    При повторном посещении сайта с этого же браузера ты увидишь тут ссылку на то место, где остановился.</div>
  <input type="text" placeholder="Введи название комикса или ссылку на него"/>
  <button>Парсить</button>

  <div>Вот, что у тебя тут сохранено:</div>
</template>
<script setup lang="ts">
</script>